stopwords = ['多种', '植物', '矿物质', '天然', '提取物', '提取液', '精华', '高效', '衍生物', '配方',
             '成分', '复合物', '萃取', '萃取物', '萃取液', '精粹', '精萃', '菁华', '原液', '进口', '香味', '味道',
             '深海', '海洋', '提取', '原料', '含有', '香料', '精油', '香型', '少女香', '清香', '香氛', '富含',
             'エキス', '抽出物', '抽出液', 'アロマ', 'オーガニック']

country_regions = [
    "阿富汗", "阿尔巴尼亚", "阿尔及利亚", "安哥拉", "阿根廷", "亚美尼亚", "澳大利亚", "奥地利", 
    "阿塞拜疆", "孟加拉", "白俄罗斯", "比利时", "伯利兹", "贝宁", "百慕大", "不丹", "玻利维亚", 
    "波斯尼亚", "博茨瓦纳", "巴西", "文莱", "保加利亚", "布基纳法索", "布隆迪", 
    "柬埔寨", "喀麦隆", "加拿大", "中非", "乍得", "智利", "中国", "哥伦比亚", "哥斯达黎加", 
    "克罗地亚", "古巴", "塞浦路斯", "捷克", "丹麦", "吉布提", "多米尼加", "东帝汶", "厄瓜多尔", 
    "埃及", "萨尔瓦多", "赤道几内亚", "厄立特里亚", "爱沙尼亚", "埃塞俄比亚", "斐济", "芬兰", 
    "法国", "法属圭亚那", "加蓬", "冈比亚", "格鲁吉亚", "德国", "加纳", "希腊", "格陵兰", 
    "危地马拉", "几内亚", "圭亚那", "海地", "洪都拉斯", "匈牙利", "冰岛", "印度", "印度尼西亚", 
    "伊朗", "伊拉克", "爱尔兰", "以色列", "意大利", "象牙海岸", "牙买加", "日本", "约旦", 
    "哈萨克斯坦", "肯尼亚", "科索沃", "科威特", "吉尔吉斯斯坦", "老挝", "拉脱维亚", "黎巴嫩", 
    "莱索托", "利比里亚", "利比亚", "立陶宛", "卢森堡", "马其顿", "马达加斯加", "马拉维", 
    "马来西亚", "马里", "毛里塔尼亚", "墨西哥", "摩尔多瓦", "蒙古", "黑山", "摩洛哥", "莫桑比克", 
    "缅甸", "纳米比亚", "尼泊尔", "荷兰", "新喀里多尼亚", "新西兰", "尼加拉瓜", "尼日尔", 
    "尼日利亚", "朝鲜", "挪威", "阿曼", "巴基斯坦", "巴拿马", "巴布亚新几内亚", "巴拉圭", 
    "秘鲁", "菲律宾", "波兰", "葡萄牙", "波多黎各", "卡塔尔", "塞尔维亚", "罗马尼亚", "俄罗斯", 
    "卢旺达", "沙特阿拉伯", "塞内加尔", "塞拉利昂", "斯洛伐克", "斯洛文尼亚", "所罗门群岛", 
    "索马里", "南非", "韩国", "西班牙", "斯里兰卡", "苏丹", "苏里南", "斯威士兰", "瑞典", 
    "瑞士", "叙利亚", "塔吉克斯坦", "泰国", "多哥", "特立尼达和多巴哥", "突尼斯", "土耳其", 
    "土库曼斯坦", "乌干达", "乌克兰", "阿拉伯联合酋长国", "英国", "美国", "乌拉圭", "乌兹别克斯坦", 
    "瓦努阿图", "委内瑞拉", "越南", "也门", "新疆", "欧洲"
]
